Table of Contents
 Interface IBIMPluginClient<T>
Namespace
IdeaStatiCa.Plugin
Assembly
IdeaStatiCa.Plugin.dll
Responsible for controlling the connected BIM application to IS
public interface IBIMPluginClient<T>
Type Parameters
T
Type of the plugin's service contract
Properties
 MyBIM
Used for calling methods of connected BIM application
T MyBIM { get; }
Property Value
T
 Status
Get status of the BIM application
AutomationStatus Status { get; }
Property Value
AutomationStatus
Methods
 RunAsync(string)
Starts client for BIM application which enables communication between Checkbot and BIM plugins
Task RunAsync(string id)
Parameters
id string
ID of the BIM application (its process id)
Returns
Task
Task wich is responsible for communication
 Stop()
Stops BIM application
void Stop()
Events
 BIMStatusChanged
Notification about events in the connected BIM application
event ISEventHandler BIMStatusChanged
Event Type
ISEventHandler
 Edit this page